spec/fixtures/vcr_cassettes/Jortt_Client_Invoices/_create/creates_the_invoice.yml

---
http_interactions:
- request:
    method: post
    uri: https://app.jortt.nl/oauth-provider/oauth/token
    body:
      encoding: UTF-8
      string: grant_type=client_credentials&scope=invoices%3Aread+invoices%3Awrite+customers%3Aread+customers%3Awrite
    headers:
      User-Agent:
      - Faraday v1.0.1
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 22 Sep 2020 13:15:46 GMT
      Content-Type:
      - application/json; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Status:
      - 200 OK
      Cache-Control:
      - private, no-store
      Referrer-Policy:
      - strict-origin-when-cross-origin
      X-Permitted-Cross-Domain-Policies:
      - none
      Pragma:
      - no-cache
      X-Xss-Protection:
      - 1; mode=block
      X-Request-Id:
      - 99c8f847-a825-4664-820f-c0a06cbf5c5b
      X-Download-Options:
      - noopen
      Etag:
      - W/"5db4f05f35fc8e4da0292eb5c6ac39c5"
      X-Frame-Options:
      - SAMEORIGIN
      X-Runtime:
      - '0.327864'
      X-Content-Type-Options:
      - nosniff
      X-Powered-By:
      - Phusion Passenger
      Server:
      - nginx + Phusion Passenger
    body:
      encoding: UTF-8
      string: '{"access_token":"0r3p4dNbwBj-QWGXTqwhtLorHUF684c_hlLETC4Ns2c","token_type":"Bearer","expires_in":7200,"scope":"invoices:read
        invoices:write customers:read customers:write","created_at":1600780546}'
  recorded_at: Tue, 22 Sep 2020 13:15:46 GMT
- request:
    method: get
    uri: https://api.jortt.nl/customers?page=1&query=Search%20target
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v1.0.1
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 22 Sep 2020 13:15:46 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1025'
      Connection:
      - keep-alive
      Server:
      - Apache
      Status:
      - 200 OK
      Content-Security-Policy:
      - 'default-src ''self'' ''unsafe-inline'' blob: data: *.jortt.nl;     script-src
        ''self'' ''unsafe-eval'' blob: ''unsafe-inline'' files.jortt.nl *.googletagmanager.com
        *.uservoice.com inlinemanual.com *.google-analytics.com *.googleadservices.com
        bat.bing.com tapfiliate.com static.ads-twitter.com tagmanager.google.com analytics.twitter.com
        https://connect.facebook.net https://app.inlinemanual.com;     connect-src
        ''self'' https://*.jortt.nl wss://*.jortt.nl analytics.inlinemanual.com files.jortt.nl
        www.google-analytics.com stats.g.doubleclick.net file-storage-app-production.s3.eu-central-1.amazonaws.com
        https://app.inlinemanual.com;     style-src ''self'' ''unsafe-inline'' fonts.googleapis.com
        files.jortt.nl tagmanager.google.com https://app.inlinemanual.com;     font-src
        ''self'' data: fonts.gstatic.com files.jortt.nl https://app.inlinemanual.com;     frame-src
        ''self'' *.jortt.nl files.jortt.nl b.frstre.com beacon.tapfiliate.com jortt.uservoice.com
        *.vimeo.com https://connect.facebook.net;     img-src ''self'' blob: data:
        *.jortt.nl https://www.facebook.com files.jortt.nl www.google-analytics.com
        stats.g.doubleclick.net www.google.nl www.google.com bat.bing.com googleads.g.doubleclick.net
        https://www.googletagmanager.com https://widget.uservoice.com www.google.de
        t.co *.gstatic.com https://ssl.google-analytics.com https://app.inlinemanual.com'
    body:
      encoding: UTF-8
      string: '{"data":[{"id":"21a81a13-312f-4914-886b-75746c300a92","is_private":true,"customer_name":"Search
        target","address_street":null,"address_postal_code":null,"address_city":null,"address_country_code":"NL","address_country_name":"Nederland","address_extra_information":null,"shift_vat":null,"vat_number":null,"coc_number":null,"initials":null,"first_name":null,"last_name":null,"date_of_birth":null,"citizen_service_number":null,"attn":null,"phonenumber":null,"website":null,"email":"stephan+jortt-gem-customer@zilverline.com","cc_emails":[],"email_salutation":"Geachte
        heer, mevrouw,","additional_information":"","payment_term":30,"invoice_language":"nl","payment_method_invoice":"pay_later","reference":null,"mollie_direct_debit_status":null,"mollie_customer_id":null,"mollie_mandate_id":null}],"_links":{"previous":null,"next":null,"self":{"href":"https://api.jortt.nl/customers?query=Search%20target\u0026page=1","type":"application/json"},"documentation":{"href":"https://developer.jortt.nl/#pagination","type":"text/html"}}}'
  recorded_at: Tue, 22 Sep 2020 13:15:46 GMT
- request:
    method: post
    uri: https://api.jortt.nl/invoices?customer_id=21a81a13-312f-4914-886b-75746c300a92&line_items%5B%5D%5Bamount_per_unit%5D%5Bcurrency%5D=EUR&line_items%5B%5D%5Bamount_per_unit%5D%5Bvalue%5D=499&line_items%5B%5D%5Bdescription%5D=Your%20product&line_items%5B%5D%5Bunits%5D=4&line_items%5B%5D%5Bvat%5D=21&send_method=self
    body:
      encoding: UTF-8
      string: ''
    headers:
      User-Agent:
      - Faraday v1.0.1
      Content-Length:
      - '0'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Date:
      - Tue, 22 Sep 2020 13:15:46 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '54'
      Connection:
      - keep-alive
      Server:
      - Apache
      Status:
      - 201 Created
      Content-Security-Policy:
      - 'default-src ''self'' ''unsafe-inline'' blob: data: *.jortt.nl;     script-src
        ''self'' ''unsafe-eval'' blob: ''unsafe-inline'' files.jortt.nl *.googletagmanager.com
        *.uservoice.com inlinemanual.com *.google-analytics.com *.googleadservices.com
        bat.bing.com tapfiliate.com static.ads-twitter.com tagmanager.google.com analytics.twitter.com
        https://connect.facebook.net https://app.inlinemanual.com;     connect-src
        ''self'' https://*.jortt.nl wss://*.jortt.nl analytics.inlinemanual.com files.jortt.nl
        www.google-analytics.com stats.g.doubleclick.net file-storage-app-production.s3.eu-central-1.amazonaws.com
        https://app.inlinemanual.com;     style-src ''self'' ''unsafe-inline'' fonts.googleapis.com
        files.jortt.nl tagmanager.google.com https://app.inlinemanual.com;     font-src
        ''self'' data: fonts.gstatic.com files.jortt.nl https://app.inlinemanual.com;     frame-src
        ''self'' *.jortt.nl files.jortt.nl b.frstre.com beacon.tapfiliate.com jortt.uservoice.com
        *.vimeo.com https://connect.facebook.net;     img-src ''self'' blob: data:
        *.jortt.nl https://www.facebook.com files.jortt.nl www.google-analytics.com
        stats.g.doubleclick.net www.google.nl www.google.com bat.bing.com googleads.g.doubleclick.net
        https://www.googletagmanager.com https://widget.uservoice.com www.google.de
        t.co *.gstatic.com https://ssl.google-analytics.com https://app.inlinemanual.com'
    body:
      encoding: UTF-8
      string: '{"data":{"id":"5b0d107e-2d2e-43d9-9d46-26b993072bba"}}'
  recorded_at: Tue, 22 Sep 2020 13:15:46 GMT
recorded_with: VCR 6.0.0
